{"config": {"name": "sequential_1", "layers": [{"config": {"activation": "relu", "data_format": "channels_last", "trainable": true, "padding": "same", "use_bias": true, "name": "conv2d_1", "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "data_format": "channels_last", "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "relu", "data_format": "channels_last", "trainable": true, "padding": "same", "use_bias": true, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "data_format": "channels_last", "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "relu", "data_format": "channels_last", "trainable": true, "padding": "same", "use_bias": true, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "data_format": "channels_last", "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_6", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "units": 512, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "trainable": true, "units": 10, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}